grevaillot/svd_tools/headers/STM32H7x7_CM4/otg_hs_global.h
/** @defgroup otg_hs_global_otg_hs_gusbcfg OTGHSGUSBCFG OTG_HS USB configuration register
@{*/

/** OTG_HS_GLOBAL_OTG_HS_GUSBCFG_FDMOD Forced peripheral mode **/
#define OTG_HS_GLOBAL_OTG_HS_GUSBCFG_FDMOD		(1 << 30)
/** OTG_HS_GLOBAL_OTG_HS_GUSBCFG_FHMOD Forced host mode **/
#define OTG_HS_GLOBAL_OTG_HS_GUSBCFG_FHMOD		(1 << 29)
/** OTG_HS_GLOBAL_OTG_HS_GUSBCFG_ULPIIPD ULPI interface protect disable **/
#define OTG_HS_GLOBAL_OTG_HS_GUSBCFG_ULPIIPD		(1 << 25)
/** OTG_HS_GLOBAL_OTG_HS_GUSBCFG_PTCI Indicator pass through **/
#define OTG_HS_GLOBAL_OTG_HS_GUSBCFG_PTCI		(1 << 24)
/** OTG_HS_GLOBAL_OTG_HS_GUSBCFG_PCCI Indicator complement **/
#define OTG_HS_GLOBAL_OTG_HS_GUSBCFG_PCCI		(1 << 23)
/** OTG_HS_GLOBAL_OTG_HS_GUSBCFG_TSDPS TermSel DLine pulsing selection **/
#define OTG_HS_GLOBAL_OTG_HS_GUSBCFG_TSDPS		(1 << 22)
/** OTG_HS_GLOBAL_OTG_HS_GUSBCFG_ULPIEVBUSI ULPI external VBUS indicator **/
#define OTG_HS_GLOBAL_OTG_HS_GUSBCFG_ULPIEVBUSI		(1 << 21)
/** OTG_HS_GLOBAL_OTG_HS_GUSBCFG_ULPIEVBUSD ULPI External VBUS Drive **/
#define OTG_HS_GLOBAL_OTG_HS_GUSBCFG_ULPIEVBUSD		(1 << 20)
/** OTG_HS_GLOBAL_OTG_HS_GUSBCFG_ULPICSM ULPI Clock SuspendM **/
#define OTG_HS_GLOBAL_OTG_HS_GUSBCFG_ULPICSM		(1 << 19)
/** OTG_HS_GLOBAL_OTG_HS_GUSBCFG_ULPIAR ULPI Auto-resume **/
#define OTG_HS_GLOBAL_OTG_HS_GUSBCFG_ULPIAR		(1 << 18)
/** OTG_HS_GLOBAL_OTG_HS_GUSBCFG_ULPIFSLS ULPI FS/LS select **/
#define OTG_HS_GLOBAL_OTG_HS_GUSBCFG_ULPIFSLS		(1 << 17)
/** OTG_HS_GLOBAL_OTG_HS_GUSBCFG_PHYLPCS PHY Low-power clock select **/
#define OTG_HS_GLOBAL_OTG_HS_GUSBCFG_PHYLPCS		(1 << 15)

#define OTG_HS_GLOBAL_OTG_HS_GUSBCFG_TRDT_SHIFT		10
#define OTG_HS_GLOBAL_OTG_HS_GUSBCFG_TRDT_MASK		0x0f
/** @defgroup otg_hs_global_otg_hs_gusbcfg_trdt TRDT USB turnaround time
@{*/
/**@}*/

/** OTG_HS_GLOBAL_OTG_HS_GUSBCFG_HNPCAP HNP-capable **/
#define OTG_HS_GLOBAL_OTG_HS_GUSBCFG_HNPCAP		(1 << 9)
/** OTG_HS_GLOBAL_OTG_HS_GUSBCFG_SRPCAP SRP-capable **/
#define OTG_HS_GLOBAL_OTG_HS_GUSBCFG_SRPCAP		(1 << 8)
/** OTG_HS_GLOBAL_OTG_HS_GUSBCFG_PHYSEL USB 2.0 high-speed ULPI PHY or USB 1.1 full-speed serial transceiver select **/
#define OTG_HS_GLOBAL_OTG_HS_GUSBCFG_PHYSEL		(1 << 6)

#define OTG_HS_GLOBAL_OTG_HS_GUSBCFG_TOCAL_SHIFT		0
#define OTG_HS_GLOBAL_OTG_HS_GUSBCFG_TOCAL_MASK		0x07
/** @defgroup otg_hs_global_otg_hs_gusbcfg_tocal TOCAL FS timeout calibration
@{*/
/**@}*/


/**@}*/

/** @defgroup otg_hs_global_otg_hs_grstctl OTGHSGRSTCTL OTG_HS reset register
@{*/

/** OTG_HS_GLOBAL_OTG_HS_GRSTCTL_AHBIDL AHB master idle **/
#define OTG_HS_GLOBAL_OTG_HS_GRSTCTL_AHBIDL		(1 << 31)
/** OTG_HS_GLOBAL_OTG_HS_GRSTCTL_DMAREQ DMA request signal enabled for USB OTG HS **/
#define OTG_HS_GLOBAL_OTG_HS_GRSTCTL_DMAREQ		(1 << 30)

#define OTG_HS_GLOBAL_OTG_HS_GRSTCTL_TXFNUM_SHIFT		6
#define OTG_HS_GLOBAL_OTG_HS_GRSTCTL_TXFNUM_MASK		0x1f
/** @defgroup otg_hs_global_otg_hs_grstctl_txfnum TXFNUM TxFIFO number
@{*/
/**@}*/

/** OTG_HS_GLOBAL_OTG_HS_GRSTCTL_TXFFLSH TxFIFO flush **/
#define OTG_HS_GLOBAL_OTG_HS_GRSTCTL_TXFFLSH		(1 << 5)
/** OTG_HS_GLOBAL_OTG_HS_GRSTCTL_RXFFLSH RxFIFO flush **/
#define OTG_HS_GLOBAL_OTG_HS_GRSTCTL_RXFFLSH		(1 << 4)
/** OTG_HS_GLOBAL_OTG_HS_GRSTCTL_FCRST Host frame counter reset **/
#define OTG_HS_GLOBAL_OTG_HS_GRSTCTL_FCRST		(1 << 2)
/** OTG_HS_GLOBAL_OTG_HS_GRSTCTL_HSRST HCLK soft reset **/
#define OTG_HS_GLOBAL_OTG_HS_GRSTCTL_HSRST		(1 << 1)
/** OTG_HS_GLOBAL_OTG_HS_GRSTCTL_CSRST Core soft reset **/
#define OTG_HS_GLOBAL_OTG_HS_GRSTCTL_CSRST		(1 << 0)

/**@}*/

/** @defgroup otg_hs_global_otg_hs_gintsts OTGHSGINTSTS OTG_HS core interrupt register
@{*/

/** OTG_HS_GLOBAL_OTG_HS_GINTSTS_WKUINT Resume/remote wakeup detected interrupt **/
#define OTG_HS_GLOBAL_OTG_HS_GINTSTS_WKUINT		(1 << 31)
/** OTG_HS_GLOBAL_OTG_HS_GINTSTS_SRQINT Session request/new session detected interrupt **/
#define OTG_HS_GLOBAL_OTG_HS_GINTSTS_SRQINT		(1 << 30)
/** OTG_HS_GLOBAL_OTG_HS_GINTSTS_DISCINT Disconnect detected interrupt **/
#define OTG_HS_GLOBAL_OTG_HS_GINTSTS_DISCINT		(1 << 29)
/** OTG_HS_GLOBAL_OTG_HS_GINTSTS_CIDSCHG Connector ID status change **/
#define OTG_HS_GLOBAL_OTG_HS_GINTSTS_CIDSCHG		(1 << 28)
/** OTG_HS_GLOBAL_OTG_HS_GINTSTS_PTXFE Periodic TxFIFO empty **/
#define OTG_HS_GLOBAL_OTG_HS_GINTSTS_PTXFE		(1 << 26)
/** OTG_HS_GLOBAL_OTG_HS_GINTSTS_HCINT Host channels interrupt **/
#define OTG_HS_GLOBAL_OTG_HS_GINTSTS_HCINT		(1 << 25)
/** OTG_HS_GLOBAL_OTG_HS_GINTSTS_HPRTINT Host port interrupt **/
#define OTG_HS_GLOBAL_OTG_HS_GINTSTS_HPRTINT		(1 << 24)
/** OTG_HS_GLOBAL_OTG_HS_GINTSTS_DATAFSUSP Data fetch suspended **/
#define OTG_HS_GLOBAL_OTG_HS_GINTSTS_DATAFSUSP		(1 << 22)
/** OTG_HS_GLOBAL_OTG_HS_GINTSTS_PXFR_INCOMPISOOUT Incomplete periodic transfer **/
#define OTG_HS_GLOBAL_OTG_HS_GINTSTS_PXFR_INCOMPISOOUT		(1 << 21)
/** OTG_HS_GLOBAL_OTG_HS_GINTSTS_IISOIXFR Incomplete isochronous IN transfer **/
#define OTG_HS_GLOBAL_OTG_HS_GINTSTS_IISOIXFR		(1 << 20)
/** OTG_HS_GLOBAL_OTG_HS_GINTSTS_OEPINT OUT endpoint interrupt **/
#define OTG_HS_GLOBAL_OTG_HS_GINTSTS_OEPINT		(1 << 19)
/** OTG_HS_GLOBAL_OTG_HS_GINTSTS_IEPINT IN endpoint interrupt **/
#define OTG_HS_GLOBAL_OTG_HS_GINTSTS_IEPINT		(1 << 18)
/** OTG_HS_GLOBAL_OTG_HS_GINTSTS_EOPF End of periodic frame interrupt **/
#define OTG_HS_GLOBAL_OTG_HS_GINTSTS_EOPF		(1 << 15)
/** OTG_HS_GLOBAL_OTG_HS_GINTSTS_ISOODRP Isochronous OUT packet dropped interrupt **/
#define OTG_HS_GLOBAL_OTG_HS_GINTSTS_ISOODRP		(1 << 14)
/** OTG_HS_GLOBAL_OTG_HS_GINTSTS_ENUMDNE Enumeration done **/
#define OTG_HS_GLOBAL_OTG_HS_GINTSTS_ENUMDNE		(1 << 13)
/** OTG_HS_GLOBAL_OTG_HS_GINTSTS_USBRST USB reset **/
#define OTG_HS_GLOBAL_OTG_HS_GINTSTS_USBRST		(1 << 12)
/** OTG_HS_GLOBAL_OTG_HS_GINTSTS_USBSUSP USB suspend **/
#define OTG_HS_GLOBAL_OTG_HS_GINTSTS_USBSUSP		(1 << 11)
/** OTG_HS_GLOBAL_OTG_HS_GINTSTS_ESUSP Early suspend **/
#define OTG_HS_GLOBAL_OTG_HS_GINTSTS_ESUSP		(1 << 10)
/** OTG_HS_GLOBAL_OTG_HS_GINTSTS_BOUTNAKEFF Global OUT NAK effective **/
#define OTG_HS_GLOBAL_OTG_HS_GINTSTS_BOUTNAKEFF		(1 << 7)
/** OTG_HS_GLOBAL_OTG_HS_GINTSTS_GINAKEFF Global IN nonperiodic NAK effective **/
#define OTG_HS_GLOBAL_OTG_HS_GINTSTS_GINAKEFF		(1 << 6)
/** OTG_HS_GLOBAL_OTG_HS_GINTSTS_NPTXFE Nonperiodic TxFIFO empty **/
#define OTG_HS_GLOBAL_OTG_HS_GINTSTS_NPTXFE		(1 << 5)
/** OTG_HS_GLOBAL_OTG_HS_GINTSTS_RXFLVL RxFIFO nonempty **/
#define OTG_HS_GLOBAL_OTG_HS_GINTSTS_RXFLVL		(1 << 4)
/** OTG_HS_GLOBAL_OTG_HS_GINTSTS_SOF Start of frame **/
#define OTG_HS_GLOBAL_OTG_HS_GINTSTS_SOF		(1 << 3)
/** OTG_HS_GLOBAL_OTG_HS_GINTSTS_OTGINT OTG interrupt **/
#define OTG_HS_GLOBAL_OTG_HS_GINTSTS_OTGINT		(1 << 2)
/** OTG_HS_GLOBAL_OTG_HS_GINTSTS_MMIS Mode mismatch interrupt **/
#define OTG_HS_GLOBAL_OTG_HS_GINTSTS_MMIS		(1 << 1)
/** OTG_HS_GLOBAL_OTG_HS_GINTSTS_CMOD Current mode of operation **/
#define OTG_HS_GLOBAL_OTG_HS_GINTSTS_CMOD		(1 << 0)

/**@}*/

