grevaillot/svd_tools/headers/STM32H7x7_CM4/otg_hs_global.h
/** @defgroup otg_hs_global_otg_hs_gintmsk OTGHSGINTMSK OTG_HS interrupt mask register
@{*/

/** OTG_HS_GLOBAL_OTG_HS_GINTMSK_WUIM Resume/remote wakeup detected interrupt mask **/
#define OTG_HS_GLOBAL_OTG_HS_GINTMSK_WUIM		(1 << 31)
/** OTG_HS_GLOBAL_OTG_HS_GINTMSK_SRQIM Session request/new session detected interrupt mask **/
#define OTG_HS_GLOBAL_OTG_HS_GINTMSK_SRQIM		(1 << 30)
/** OTG_HS_GLOBAL_OTG_HS_GINTMSK_DISCINT Disconnect detected interrupt mask **/
#define OTG_HS_GLOBAL_OTG_HS_GINTMSK_DISCINT		(1 << 29)
/** OTG_HS_GLOBAL_OTG_HS_GINTMSK_CIDSCHGM Connector ID status change mask **/
#define OTG_HS_GLOBAL_OTG_HS_GINTMSK_CIDSCHGM		(1 << 28)
/** OTG_HS_GLOBAL_OTG_HS_GINTMSK_LPMINTM LPM interrupt mask **/
#define OTG_HS_GLOBAL_OTG_HS_GINTMSK_LPMINTM		(1 << 27)
/** OTG_HS_GLOBAL_OTG_HS_GINTMSK_PTXFEM Periodic TxFIFO empty mask **/
#define OTG_HS_GLOBAL_OTG_HS_GINTMSK_PTXFEM		(1 << 26)
/** OTG_HS_GLOBAL_OTG_HS_GINTMSK_HCIM Host channels interrupt mask **/
#define OTG_HS_GLOBAL_OTG_HS_GINTMSK_HCIM		(1 << 25)
/** OTG_HS_GLOBAL_OTG_HS_GINTMSK_PRTIM Host port interrupt mask **/
#define OTG_HS_GLOBAL_OTG_HS_GINTMSK_PRTIM		(1 << 24)
/** OTG_HS_GLOBAL_OTG_HS_GINTMSK_RSTDE Reset detected interrupt mask **/
#define OTG_HS_GLOBAL_OTG_HS_GINTMSK_RSTDE		(1 << 23)
/** OTG_HS_GLOBAL_OTG_HS_GINTMSK_FSUSPM Data fetch suspended mask **/
#define OTG_HS_GLOBAL_OTG_HS_GINTMSK_FSUSPM		(1 << 22)
/** OTG_HS_GLOBAL_OTG_HS_GINTMSK_PXFRM_IISOOXFRM Incomplete periodic transfer mask **/
#define OTG_HS_GLOBAL_OTG_HS_GINTMSK_PXFRM_IISOOXFRM		(1 << 21)
/** OTG_HS_GLOBAL_OTG_HS_GINTMSK_IISOIXFRM Incomplete isochronous IN transfer mask **/
#define OTG_HS_GLOBAL_OTG_HS_GINTMSK_IISOIXFRM		(1 << 20)
/** OTG_HS_GLOBAL_OTG_HS_GINTMSK_OEPINT OUT endpoints interrupt mask **/
#define OTG_HS_GLOBAL_OTG_HS_GINTMSK_OEPINT		(1 << 19)
/** OTG_HS_GLOBAL_OTG_HS_GINTMSK_IEPINT IN endpoints interrupt mask **/
#define OTG_HS_GLOBAL_OTG_HS_GINTMSK_IEPINT		(1 << 18)
/** OTG_HS_GLOBAL_OTG_HS_GINTMSK_EOPFM End of periodic frame interrupt mask **/
#define OTG_HS_GLOBAL_OTG_HS_GINTMSK_EOPFM		(1 << 15)
/** OTG_HS_GLOBAL_OTG_HS_GINTMSK_ISOODRPM Isochronous OUT packet dropped interrupt mask **/
#define OTG_HS_GLOBAL_OTG_HS_GINTMSK_ISOODRPM		(1 << 14)
/** OTG_HS_GLOBAL_OTG_HS_GINTMSK_ENUMDNEM Enumeration done mask **/
#define OTG_HS_GLOBAL_OTG_HS_GINTMSK_ENUMDNEM		(1 << 13)
/** OTG_HS_GLOBAL_OTG_HS_GINTMSK_USBRST USB reset mask **/
#define OTG_HS_GLOBAL_OTG_HS_GINTMSK_USBRST		(1 << 12)
/** OTG_HS_GLOBAL_OTG_HS_GINTMSK_USBSUSPM USB suspend mask **/
#define OTG_HS_GLOBAL_OTG_HS_GINTMSK_USBSUSPM		(1 << 11)
/** OTG_HS_GLOBAL_OTG_HS_GINTMSK_ESUSPM Early suspend mask **/
#define OTG_HS_GLOBAL_OTG_HS_GINTMSK_ESUSPM		(1 << 10)
/** OTG_HS_GLOBAL_OTG_HS_GINTMSK_GONAKEFFM Global OUT NAK effective mask **/
#define OTG_HS_GLOBAL_OTG_HS_GINTMSK_GONAKEFFM		(1 << 7)
/** OTG_HS_GLOBAL_OTG_HS_GINTMSK_GINAKEFFM Global nonperiodic IN NAK effective mask **/
#define OTG_HS_GLOBAL_OTG_HS_GINTMSK_GINAKEFFM		(1 << 6)
/** OTG_HS_GLOBAL_OTG_HS_GINTMSK_NPTXFEM Nonperiodic TxFIFO empty mask **/
#define OTG_HS_GLOBAL_OTG_HS_GINTMSK_NPTXFEM		(1 << 5)
/** OTG_HS_GLOBAL_OTG_HS_GINTMSK_RXFLVLM Receive FIFO nonempty mask **/
#define OTG_HS_GLOBAL_OTG_HS_GINTMSK_RXFLVLM		(1 << 4)
/** OTG_HS_GLOBAL_OTG_HS_GINTMSK_SOFM Start of frame mask **/
#define OTG_HS_GLOBAL_OTG_HS_GINTMSK_SOFM		(1 << 3)
/** OTG_HS_GLOBAL_OTG_HS_GINTMSK_OTGINT OTG interrupt mask **/
#define OTG_HS_GLOBAL_OTG_HS_GINTMSK_OTGINT		(1 << 2)
/** OTG_HS_GLOBAL_OTG_HS_GINTMSK_MMISM Mode mismatch interrupt mask **/
#define OTG_HS_GLOBAL_OTG_HS_GINTMSK_MMISM		(1 << 1)

/**@}*/

/** @defgroup otg_hs_global_otg_hs_grxstsr_host OTGHSGRXSTSRHost OTG_HS Receive status debug read register (host mode)
@{*/


#define OTG_HS_GLOBAL_OTG_HS_GRXSTSR_Host_PKTSTS_SHIFT		17
#define OTG_HS_GLOBAL_OTG_HS_GRXSTSR_Host_PKTSTS_MASK		0x0f
/** @defgroup otg_hs_global_otg_hs_grxstsr_host_pktsts PKTSTS Packet status
@{*/
/**@}*/


#define OTG_HS_GLOBAL_OTG_HS_GRXSTSR_Host_DPID_SHIFT		15
#define OTG_HS_GLOBAL_OTG_HS_GRXSTSR_Host_DPID_MASK		0x03
/** @defgroup otg_hs_global_otg_hs_grxstsr_host_dpid DPID Data PID
@{*/
/**@}*/


#define OTG_HS_GLOBAL_OTG_HS_GRXSTSR_Host_BCNT_SHIFT		4
#define OTG_HS_GLOBAL_OTG_HS_GRXSTSR_Host_BCNT_MASK		0x7ff
/** @defgroup otg_hs_global_otg_hs_grxstsr_host_bcnt BCNT Byte count
@{*/
/**@}*/


#define OTG_HS_GLOBAL_OTG_HS_GRXSTSR_Host_CHNUM_SHIFT		0
#define OTG_HS_GLOBAL_OTG_HS_GRXSTSR_Host_CHNUM_MASK		0x0f
/** @defgroup otg_hs_global_otg_hs_grxstsr_host_chnum CHNUM Channel number
@{*/
/**@}*/


/**@}*/

/** @defgroup otg_hs_global_otg_hs_grxstsr_device OTGHSGRXSTSRDevice OTG_HS Receive status debug read register (peripheral mode mode)
@{*/


#define OTG_HS_GLOBAL_OTG_HS_GRXSTSR_Device_FRMNUM_SHIFT		21
#define OTG_HS_GLOBAL_OTG_HS_GRXSTSR_Device_FRMNUM_MASK		0x0f
/** @defgroup otg_hs_global_otg_hs_grxstsr_device_frmnum FRMNUM Frame number
@{*/
/**@}*/


#define OTG_HS_GLOBAL_OTG_HS_GRXSTSR_Device_PKTSTS_SHIFT		17
#define OTG_HS_GLOBAL_OTG_HS_GRXSTSR_Device_PKTSTS_MASK		0x0f
/** @defgroup otg_hs_global_otg_hs_grxstsr_device_pktsts PKTSTS Packet status
@{*/
/**@}*/


#define OTG_HS_GLOBAL_OTG_HS_GRXSTSR_Device_DPID_SHIFT		15
#define OTG_HS_GLOBAL_OTG_HS_GRXSTSR_Device_DPID_MASK		0x03
/** @defgroup otg_hs_global_otg_hs_grxstsr_device_dpid DPID Data PID
@{*/
/**@}*/


#define OTG_HS_GLOBAL_OTG_HS_GRXSTSR_Device_BCNT_SHIFT		4
#define OTG_HS_GLOBAL_OTG_HS_GRXSTSR_Device_BCNT_MASK		0x7ff
/** @defgroup otg_hs_global_otg_hs_grxstsr_device_bcnt BCNT Byte count
@{*/
/**@}*/


#define OTG_HS_GLOBAL_OTG_HS_GRXSTSR_Device_EPNUM_SHIFT		0
#define OTG_HS_GLOBAL_OTG_HS_GRXSTSR_Device_EPNUM_MASK		0x0f
/** @defgroup otg_hs_global_otg_hs_grxstsr_device_epnum EPNUM Endpoint number
@{*/
/**@}*/


/**@}*/

/** @defgroup otg_hs_global_otg_hs_grxstsp_host OTGHSGRXSTSPHost OTG_HS status read and pop register (host mode)
@{*/


#define OTG_HS_GLOBAL_OTG_HS_GRXSTSP_Host_PKTSTS_SHIFT		17
#define OTG_HS_GLOBAL_OTG_HS_GRXSTSP_Host_PKTSTS_MASK		0x0f
/** @defgroup otg_hs_global_otg_hs_grxstsp_host_pktsts PKTSTS Packet status
@{*/
/**@}*/


