grevaillot/svd_tools/headers/STM32H7x7_CM4/otg_hs_global.h
#define OTG_HS_GLOBAL_OTG_HS_GRXSTSP_Host_DPID_SHIFT		15
#define OTG_HS_GLOBAL_OTG_HS_GRXSTSP_Host_DPID_MASK		0x03
/** @defgroup otg_hs_global_otg_hs_grxstsp_host_dpid DPID Data PID
@{*/
/**@}*/


#define OTG_HS_GLOBAL_OTG_HS_GRXSTSP_Host_BCNT_SHIFT		4
#define OTG_HS_GLOBAL_OTG_HS_GRXSTSP_Host_BCNT_MASK		0x7ff
/** @defgroup otg_hs_global_otg_hs_grxstsp_host_bcnt BCNT Byte count
@{*/
/**@}*/


#define OTG_HS_GLOBAL_OTG_HS_GRXSTSP_Host_CHNUM_SHIFT		0
#define OTG_HS_GLOBAL_OTG_HS_GRXSTSP_Host_CHNUM_MASK		0x0f
/** @defgroup otg_hs_global_otg_hs_grxstsp_host_chnum CHNUM Channel number
@{*/
/**@}*/


/**@}*/

/** @defgroup otg_hs_global_otg_hs_grxstsp_device OTGHSGRXSTSPDevice OTG_HS status read and pop register (peripheral mode)
@{*/


#define OTG_HS_GLOBAL_OTG_HS_GRXSTSP_Device_FRMNUM_SHIFT		21
#define OTG_HS_GLOBAL_OTG_HS_GRXSTSP_Device_FRMNUM_MASK		0x0f
/** @defgroup otg_hs_global_otg_hs_grxstsp_device_frmnum FRMNUM Frame number
@{*/
/**@}*/


#define OTG_HS_GLOBAL_OTG_HS_GRXSTSP_Device_PKTSTS_SHIFT		17
#define OTG_HS_GLOBAL_OTG_HS_GRXSTSP_Device_PKTSTS_MASK		0x0f
/** @defgroup otg_hs_global_otg_hs_grxstsp_device_pktsts PKTSTS Packet status
@{*/
/**@}*/


#define OTG_HS_GLOBAL_OTG_HS_GRXSTSP_Device_DPID_SHIFT		15
#define OTG_HS_GLOBAL_OTG_HS_GRXSTSP_Device_DPID_MASK		0x03
/** @defgroup otg_hs_global_otg_hs_grxstsp_device_dpid DPID Data PID
@{*/
/**@}*/


#define OTG_HS_GLOBAL_OTG_HS_GRXSTSP_Device_BCNT_SHIFT		4
#define OTG_HS_GLOBAL_OTG_HS_GRXSTSP_Device_BCNT_MASK		0x7ff
/** @defgroup otg_hs_global_otg_hs_grxstsp_device_bcnt BCNT Byte count
@{*/
/**@}*/


#define OTG_HS_GLOBAL_OTG_HS_GRXSTSP_Device_EPNUM_SHIFT		0
#define OTG_HS_GLOBAL_OTG_HS_GRXSTSP_Device_EPNUM_MASK		0x0f
/** @defgroup otg_hs_global_otg_hs_grxstsp_device_epnum EPNUM Endpoint number
@{*/
/**@}*/


/**@}*/

/** @defgroup otg_hs_global_otg_hs_grxfsiz OTGHSGRXFSIZ OTG_HS Receive FIFO size register
@{*/


#define OTG_HS_GLOBAL_OTG_HS_GRXFSIZ_RXFD_SHIFT		0
#define OTG_HS_GLOBAL_OTG_HS_GRXFSIZ_RXFD_MASK		0xffff
/** @defgroup otg_hs_global_otg_hs_grxfsiz_rxfd RXFD RxFIFO depth
@{*/
/**@}*/


/**@}*/

/** @defgroup otg_hs_global_otg_hs_hnptxfsiz_host OTGHSHNPTXFSIZHost OTG_HS nonperiodic transmit FIFO size register (host mode)
@{*/


#define OTG_HS_GLOBAL_OTG_HS_HNPTXFSIZ_Host_NPTXFD_SHIFT		16
#define OTG_HS_GLOBAL_OTG_HS_HNPTXFSIZ_Host_NPTXFD_MASK		0xffff
/** @defgroup otg_hs_global_otg_hs_hnptxfsiz_host_nptxfd NPTXFD Nonperiodic TxFIFO depth
@{*/
/**@}*/


#define OTG_HS_GLOBAL_OTG_HS_HNPTXFSIZ_Host_NPTXFSA_SHIFT		0
#define OTG_HS_GLOBAL_OTG_HS_HNPTXFSIZ_Host_NPTXFSA_MASK		0xffff
/** @defgroup otg_hs_global_otg_hs_hnptxfsiz_host_nptxfsa NPTXFSA Nonperiodic transmit RAM start address
@{*/
/**@}*/


/**@}*/

/** @defgroup otg_hs_global_otg_hs_dieptxf0_device OTGHSDIEPTXF0Device Endpoint 0 transmit FIFO size (peripheral mode)
@{*/


#define OTG_HS_GLOBAL_OTG_HS_DIEPTXF0_Device_TX0FD_SHIFT		16
#define OTG_HS_GLOBAL_OTG_HS_DIEPTXF0_Device_TX0FD_MASK		0xffff
/** @defgroup otg_hs_global_otg_hs_dieptxf0_device_tx0fd TX0FD Endpoint 0 TxFIFO depth
@{*/
/**@}*/


#define OTG_HS_GLOBAL_OTG_HS_DIEPTXF0_Device_TX0FSA_SHIFT		0
#define OTG_HS_GLOBAL_OTG_HS_DIEPTXF0_Device_TX0FSA_MASK		0xffff
/** @defgroup otg_hs_global_otg_hs_dieptxf0_device_tx0fsa TX0FSA Endpoint 0 transmit RAM start address
@{*/
/**@}*/


/**@}*/

/** @defgroup otg_hs_global_otg_hs_hnptxsts OTGHSHNPTXSTS OTG_HS nonperiodic transmit FIFO/queue status register
@{*/


#define OTG_HS_GLOBAL_OTG_HS_HNPTXSTS_NPTXQTOP_SHIFT		24
#define OTG_HS_GLOBAL_OTG_HS_HNPTXSTS_NPTXQTOP_MASK		0x7f
/** @defgroup otg_hs_global_otg_hs_hnptxsts_nptxqtop NPTXQTOP Top of the nonperiodic transmit request queue
@{*/
/**@}*/


#define OTG_HS_GLOBAL_OTG_HS_HNPTXSTS_NPTQXSAV_SHIFT		16
#define OTG_HS_GLOBAL_OTG_HS_HNPTXSTS_NPTQXSAV_MASK		0xff
/** @defgroup otg_hs_global_otg_hs_hnptxsts_nptqxsav NPTQXSAV Nonperiodic transmit request queue space available
@{*/
/**@}*/


#define OTG_HS_GLOBAL_OTG_HS_HNPTXSTS_NPTXFSAV_SHIFT		0
#define OTG_HS_GLOBAL_OTG_HS_HNPTXSTS_NPTXFSAV_MASK		0xffff
/** @defgroup otg_hs_global_otg_hs_hnptxsts_nptxfsav NPTXFSAV Nonperiodic TxFIFO space available
@{*/
/**@}*/


/**@}*/

/** @defgroup otg_hs_global_otg_hs_gi2cctl OTGHSGI2CCTL OTG I2C access register
@{*/

/** OTG_HS_GLOBAL_OTG_HS_GI2CCTL_BSYDNE I2C Busy/Done **/
#define OTG_HS_GLOBAL_OTG_HS_GI2CCTL_BSYDNE		(1 << 31)
/** OTG_HS_GLOBAL_OTG_HS_GI2CCTL_RW Read/Write Indicator **/
#define OTG_HS_GLOBAL_OTG_HS_GI2CCTL_RW		(1 << 30)
/** OTG_HS_GLOBAL_OTG_HS_GI2CCTL_I2CDATSE0 I2C DatSe0 USB mode **/
#define OTG_HS_GLOBAL_OTG_HS_GI2CCTL_I2CDATSE0		(1 << 28)

#define OTG_HS_GLOBAL_OTG_HS_GI2CCTL_I2CDEVADR_SHIFT		26
#define OTG_HS_GLOBAL_OTG_HS_GI2CCTL_I2CDEVADR_MASK		0x03
/** @defgroup otg_hs_global_otg_hs_gi2cctl_i2cdevadr I2CDEVADR I2C Device Address
@{*/
/**@}*/

/** OTG_HS_GLOBAL_OTG_HS_GI2CCTL_ACK I2C ACK **/
#define OTG_HS_GLOBAL_OTG_HS_GI2CCTL_ACK		(1 << 24)
/** OTG_HS_GLOBAL_OTG_HS_GI2CCTL_I2CEN I2C Enable **/
#define OTG_HS_GLOBAL_OTG_HS_GI2CCTL_I2CEN		(1 << 23)

#define OTG_HS_GLOBAL_OTG_HS_GI2CCTL_ADDR_SHIFT		16
#define OTG_HS_GLOBAL_OTG_HS_GI2CCTL_ADDR_MASK		0x7f
/** @defgroup otg_hs_global_otg_hs_gi2cctl_addr ADDR I2C Address
@{*/
/**@}*/


#define OTG_HS_GLOBAL_OTG_HS_GI2CCTL_REGADDR_SHIFT		8
#define OTG_HS_GLOBAL_OTG_HS_GI2CCTL_REGADDR_MASK		0xff
/** @defgroup otg_hs_global_otg_hs_gi2cctl_regaddr REGADDR I2C Register Address
@{*/
/**@}*/


#define OTG_HS_GLOBAL_OTG_HS_GI2CCTL_RWDATA_SHIFT		0
#define OTG_HS_GLOBAL_OTG_HS_GI2CCTL_RWDATA_MASK		0xff
/** @defgroup otg_hs_global_otg_hs_gi2cctl_rwdata RWDATA I2C Read/Write Data
@{*/
/**@}*/


/**@}*/

/** @defgroup otg_hs_global_otg_hs_gccfg OTGHSGCCFG OTG_HS general core configuration register
@{*/

/** OTG_HS_GLOBAL_OTG_HS_GCCFG_VBDEN USB VBUS detection enable **/
#define OTG_HS_GLOBAL_OTG_HS_GCCFG_VBDEN		(1 << 21)
/** OTG_HS_GLOBAL_OTG_HS_GCCFG_SDEN Secondary detection (SD) mode enable **/
#define OTG_HS_GLOBAL_OTG_HS_GCCFG_SDEN		(1 << 20)
/** OTG_HS_GLOBAL_OTG_HS_GCCFG_PDEN Primary detection (PD) mode enable **/
#define OTG_HS_GLOBAL_OTG_HS_GCCFG_PDEN		(1 << 19)
/** OTG_HS_GLOBAL_OTG_HS_GCCFG_DCDEN Data contact detection (DCD) mode enable **/
#define OTG_HS_GLOBAL_OTG_HS_GCCFG_DCDEN		(1 << 18)
/** OTG_HS_GLOBAL_OTG_HS_GCCFG_BCDEN Battery charging detector (BCD) enable **/
#define OTG_HS_GLOBAL_OTG_HS_GCCFG_BCDEN		(1 << 17)
/** OTG_HS_GLOBAL_OTG_HS_GCCFG_PWRDWN Power down **/
#define OTG_HS_GLOBAL_OTG_HS_GCCFG_PWRDWN		(1 << 16)
/** OTG_HS_GLOBAL_OTG_HS_GCCFG_PS2DET DM pull-up detection status **/
#define OTG_HS_GLOBAL_OTG_HS_GCCFG_PS2DET		(1 << 3)
/** OTG_HS_GLOBAL_OTG_HS_GCCFG_SDET Secondary detection (SD) status **/
#define OTG_HS_GLOBAL_OTG_HS_GCCFG_SDET		(1 << 2)
/** OTG_HS_GLOBAL_OTG_HS_GCCFG_PDET Primary detection (PD) status **/
#define OTG_HS_GLOBAL_OTG_HS_GCCFG_PDET		(1 << 1)
/** OTG_HS_GLOBAL_OTG_HS_GCCFG_DCDET Data contact detection (DCD) status **/
#define OTG_HS_GLOBAL_OTG_HS_GCCFG_DCDET		(1 << 0)

/**@}*/

/** @defgroup otg_hs_global_otg_hs_cid OTGHSCID OTG_HS core ID register
@{*/


